# running in fv_reg_wbr/src/
read -formal register_file.sv
read -formal fv_reg_wbr.sv
prep -top fv_reg_wbr

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
